# объявление функции
def number_to_words(num):
    imya = ''
    list1 = ['один', 'два', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять']
    list2 = ['одиннадцать', 'двенадцать', 'тринадцать', 'четырнадцать', 'пятнадцать', 'шестнадцать', 'семнадцать',
             'восемнадцать', 'девятнадцать']
    list3 = ['десять', 'двадцать', 'тридцать', 'сорок', 'пятьдесят', 'шестьдесят', 'семьдесят', 'восемьдесят',
             'девяносто']
    if 1 <= num <= 9:
        imya = list1[num - 1]
    elif 11 <= num <= 19:
        imya = list2[num-11]
    elif 10 <= num <= 90 and num % 10 == 0:
        a= num//10
        imya = list3[a-1]
    elif 21 <= num <= 99:
        num1 = num // 10
        num2 = num % 10
        imya = list3[num1 - 1] + ' ' + list1[num2 - 1]
    return imya


# считываем данные
n = int(input('введите число:\n'))

# вызываем функцию
print(number_to_words(n))
